<a href="https://colab.research.google.com/github/hamagami/preprocess/blob/main/03_04_%E6%A7%8B%E9%80%A0%E5%8C%96%E3%83%87%E3%83%BC%E3%82%BF%E3%81%AE%E6%93%8D%E4%BD%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 構造化データの操作
pandas の表の操作例を簡単なデータを使って試してみます

In [3]:
import pandas as pd
from pandas import Series, DataFrame

## 簡単なデータと直接つくります

In [4]:
# データ1の準備
data1 = {'ID':['100','101','102','105','106']
        ,'city':['Tokyo','Chiba','Kyoto','Gunma','Tokyo']
        ,'birth_year':[1991,1992,1985,1996,1981]
        ,'name':['Yamada','Sato','Suzuki','Kitamura','Aoki']}
df1 = DataFrame(data1)

# データ2の準備
data2 = {'ID':['100','101','102','103','104']
        ,'math':[34,77,45,81,98]
        ,'English':[47,64,16,53,37]
        ,'sex':['F','M','F','F','M']
        ,'index_num':[0,1,2,3,4]}
df2 = DataFrame(data2)

## データを表示します

In [5]:
df1

    ID   city  birth_year      name
0  100  Tokyo        1991    Yamada
1  101  Chiba        1992      Sato
2  102  Kyoto        1985    Suzuki
3  105  Gunma        1996  Kitamura
4  106  Tokyo        1981      Aoki

In [6]:
df2

    ID  math  English sex  index_num
0  100    34       47   F          0
1  101    77       64   M          1
2  102    45       16   F          2
3  103    81       53   F          3
4  104    98       37   M          4

## 内部結合の例  innner outer left right index

In [7]:
# IDで内部結合
inner_join = pd.merge(df1, df2, how="inner" ,on="ID")
# Left join
left_join  = pd.merge(df1, df2, how="left", on="ID")
right_join = pd.merge(df1,df2,how="right", on="ID")
# Outer join
outer_join=pd.merge(df1, df2, how="outer", on="ID")
# indexによる結合
index_join=pd.merge(df1, df2, left_index=True, right_on="index_num")

In [8]:
inner_join

    ID   city  birth_year    name  math  English sex  index_num
0  100  Tokyo        1991  Yamada    34       47   F          0
1  101  Chiba        1992    Sato    77       64   M          1
2  102  Kyoto        1985  Suzuki    45       16   F          2

In [9]:
outer_join

    ID   city  birth_year      name  math  English  sex  index_num
0  100  Tokyo      1991.0    Yamada  34.0     47.0    F        0.0
1  101  Chiba      1992.0      Sato  77.0     64.0    M        1.0
2  102  Kyoto      1985.0    Suzuki  45.0     16.0    F        2.0
3  105  Gunma      1996.0  Kitamura   NaN      NaN  NaN        NaN
4  106  Tokyo      1981.0      Aoki   NaN      NaN  NaN        NaN
5  103    NaN         NaN       NaN  81.0     53.0    F        3.0
6  104    NaN         NaN       NaN  98.0     37.0    M        4.0

In [10]:
left_join

    ID   city  birth_year      name  math  English  sex  index_num
0  100  Tokyo        1991    Yamada  34.0     47.0    F        0.0
1  101  Chiba        1992      Sato  77.0     64.0    M        1.0
2  102  Kyoto        1985    Suzuki  45.0     16.0    F        2.0
3  105  Gunma        1996  Kitamura   NaN      NaN  NaN        NaN
4  106  Tokyo        1981      Aoki   NaN      NaN  NaN        NaN

In [11]:
right_join

    ID   city  birth_year    name  math  English sex  index_num
0  100  Tokyo      1991.0  Yamada    34       47   F          0
1  101  Chiba      1992.0    Sato    77       64   M          1
2  102  Kyoto      1985.0  Suzuki    45       16   F          2
3  103    NaN         NaN     NaN    81       53   F          3
4  104    NaN         NaN     NaN    98       37   M          4

In [12]:
index_join

  ID_x   city  birth_year      name ID_y  math  English sex  index_num
0  100  Tokyo        1991    Yamada  100    34       47   F          0
1  101  Chiba        1992      Sato  101    77       64   M          1
2  102  Kyoto        1985    Suzuki  102    45       16   F          2
3  105  Gunma        1996  Kitamura  103    81       53   F          3
4  106  Tokyo        1981      Aoki  104    98       37   M          4

## concatinate用の別データ

In [14]:
# データ1の準備
data3 = {'ID':['100','101','102','105','106']
        ,'city':['Tokyo','Chiba','Kyoto','Gunma','Tokyo']
        ,'birth_year':[1991,1992,1985,1996,1981]
        ,'name':['Yamada','Sato','Suzuki','Kitamura','Aoki']}
df3 = DataFrame(data3)

# データ3の準備
data4 = {'ID':['110','111','112']
        ,'city':['Akita','Okinawa','Fukuoka']
        ,'birth_year':[1992,1987,1990]
        ,'name':['Ishida','Takada','Shimada']}
df4 = DataFrame(data4)

In [15]:
df3

    ID   city  birth_year      name
0  100  Tokyo        1991    Yamada
1  101  Chiba        1992      Sato
2  102  Kyoto        1985    Suzuki
3  105  Gunma        1996  Kitamura
4  106  Tokyo        1981      Aoki

In [16]:
df4

    ID     city  birth_year     name
0  110    Akita        1992   Ishida
1  111  Okinawa        1987   Takada
2  112  Fukuoka        1990  Shimada

In [17]:
# concatinate
concat=pd.concat([df3, df4])

In [18]:
concat

    ID     city  birth_year      name
0  100    Tokyo        1991    Yamada
1  101    Chiba        1992      Sato
2  102    Kyoto        1985    Suzuki
3  105    Gunma        1996  Kitamura
4  106    Tokyo        1981      Aoki
0  110    Akita        1992    Ishida
1  111  Okinawa        1987    Takada
2  112  Fukuoka        1990   Shimada

In [19]:
pd.merge(df3, df4, how="outer")

    ID     city  birth_year      name
0  100    Tokyo        1991    Yamada
1  101    Chiba        1992      Sato
2  102    Kyoto        1985    Suzuki
3  105    Gunma        1996  Kitamura
4  106    Tokyo        1981      Aoki
5  110    Akita        1992    Ishida
6  111  Okinawa        1987    Takada
7  112  Fukuoka        1990   Shimada

## カラム削除の例

In [20]:
df3.drop("name",axis=1)

    ID   city  birth_year
0  100  Tokyo        1991
1  101  Chiba        1992
2  102  Kyoto        1985
3  105  Gunma        1996
4  106  Tokyo        1981

In [ ]:
df3['city'].str.cat([df3['name']], sep='-')

0      Tokyo-Yamada
1        Chiba-Sato
2      Kyoto-Suzuki
3    Gunma-Kitamura
4        Tokyo-Aoki
Name: city, dtype: object

## カラムを結合して別のカラムをつくる例

In [21]:
  df3["cityname"]=df3['city'].str.cat([df3['name']], sep='-')

In [ ]:
df3

    ID   city  birth_year      name        cityname
0  100  Tokyo        1991    Yamada    Tokyo-Yamada
1  101  Chiba        1992      Sato      Chiba-Sato
2  102  Kyoto        1985    Suzuki    Kyoto-Suzuki
3  105  Gunma        1996  Kitamura  Gunma-Kitamura
4  106  Tokyo        1981      Aoki      Tokyo-Aoki